//TPRINT  JOB (CLK#,APP6,0030,0010),'EMAIL',CLASS=T,MSGCLASS=R,
//             REGION=6M,NOTIFY=&SYSUID
//*--------------------------------------------------
//* Change the job card to your standards
//* Change the FORMS=A041696 to match a member name
//*   in your address book
//*--------------------------------------------------
//TPRINT  EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//OUT1     OUTPUT  FORMS=A041696,DEST=EMAIL
//SYSUT2   DD SYSOUT=A,OUTPUT=(*.OUT1)
//SYSUT1   DD *
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
THIS IS A TEST PRINT
/*
//*--------------------------------------------------
